# ####################################################################

#  Created by Genus(TM) Synthesis Solution 19.14-s108_1 on Wed Nov 20 06:26:06 +03 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design symmetricFIR

create_clock -name "fir_clk" -period 5.0 -waveform {2.5 5.0} [get_ports clk_i]
set_clock_transition -max 0.2 [get_clocks fir_clk]
set_load -pin_load -max 0.001 [get_ports {signal_o[21]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[20]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[19]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[18]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[17]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[16]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[15]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[14]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[13]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[12]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[11]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[10]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[9]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[8]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[7]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[6]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[5]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[4]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[3]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[2]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[1]}]
set_load -pin_load -max 0.001 [get_ports {signal_o[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports rst_i]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports load_i]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef0_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef0_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef0_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef0_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef0_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef0_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef0_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef0_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef1_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef1_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef1_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef1_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef1_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef1_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef1_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef1_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef2_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef2_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef2_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef2_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef2_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef2_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef2_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef2_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef3_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef3_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef3_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef3_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef3_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef3_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef3_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef3_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef4_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef4_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef4_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef4_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef4_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef4_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef4_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef4_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef5_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef5_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef5_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef5_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef5_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef5_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef5_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {coef5_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[11]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[10]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[9]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[8]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports rst_i]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports load_i]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef0_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef0_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef0_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef0_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef0_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef0_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef0_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef0_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef1_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef1_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef1_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef1_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef1_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef1_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef1_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef1_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef2_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef2_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef2_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef2_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef2_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef2_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef2_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef2_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef3_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef3_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef3_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef3_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef3_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef3_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef3_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef3_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef4_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef4_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef4_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef4_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef4_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef4_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef4_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef4_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef5_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef5_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef5_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef5_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef5_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef5_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef5_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {coef5_i[0]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[11]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[10]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[9]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[8]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[7]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[6]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[5]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[4]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[3]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[2]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[1]}]
set_input_delay -clock [get_clocks fir_clk] -add_delay -min 0.2 [get_ports {signal_i[0]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[21]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[20]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[19]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[18]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[17]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[16]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[15]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[14]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[13]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[12]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[11]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[10]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[9]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[8]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[7]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[6]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[5]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[4]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[3]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[2]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[1]}]
set_output_delay -clock [get_clocks fir_clk] -add_delay -max 0.5 [get_ports {signal_o[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports clk_i]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports rst_i]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports load_i]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef0_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef0_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef0_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef0_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef0_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef0_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef0_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef0_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef1_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef1_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef1_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef1_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef1_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef1_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef1_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef1_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef2_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef2_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef2_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef2_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef2_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef2_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef2_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef2_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef3_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef3_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef3_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef3_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef3_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef3_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef3_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef3_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef4_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef4_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef4_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef4_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef4_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef4_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef4_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef4_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef5_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef5_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef5_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef5_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef5_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef5_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef5_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {coef5_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin "X" [get_ports {signal_i[0]}]
set_clock_uncertainty -setup 0.2 [get_clocks fir_clk]
set_clock_uncertainty -hold 0.2 [get_clocks fir_clk]
